src/ПодсистемаPAPI/Catalogs/PAPI_ПодпискиНаСобытия.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Catalog>
		<Properties>
			<Name>PAPI_ПодпискиНаСобытия</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Алгоритм</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.PAPI_Алгоритмы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВнешняяОбработка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.PAPI_ВнешняяОбработка</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Настройки</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Приоритет</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Разрешен</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Событие</Name>
					<Type>
						<v8:Type>cfg:EnumRef.PAPI_ТипПодпискиНаСобытие</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипВыполнения</Name>
					<Type>
						<v8:Type>cfg:EnumRef.PAPI_ТипВыполнения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Источники</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Источник</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>200</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Подписка</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>1</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/ПодсистемаPAPI/Enums/PAPI_ТипВыполнения.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>PAPI_ТипВыполнения</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Алгоритм</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Произвольный</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВнешняяОбработка</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/ПодсистемаPAPI/Enums/PAPI_ТипПодпискиНаСобытие.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>PAPI_ТипПодпискиНаСобытие</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ПриКопировании</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОбработкаПроверкиЗаполнения</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПередЗаписью</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПриЗаписи</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПередУдалением</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОбработкаПроведения</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОбработкаУдаленияПроведения</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОбработкаФормированияПоВерсииИсторииДанных</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОбработкаПослеЗаписиВерсийИсторииДанных</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/ПодсистемаPAPI/Catalogs/PAPI_ПодпискиНаСобытия/Forms/ФормаЭлемента/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Объект.Ссылка.Пустая() Тогда 
		
		// Создан копированием++
		Если ЗначениеЗаполнено(Параметры.ЗначениеКопирования)
			И ТипЗнч(Параметры.ЗначениеКопирования) = Тип("СправочникСсылка.PAPI_ПодпискиНаСобытия") Тогда	
			
			ПриЧтенииНаСервере(Параметры.ЗначениеКопирования);
				
		КонецЕсли;
		// Создан копированием--
	
		Если Не ЗначениеЗаполнено(Объект.ТипВыполнения) Тогда 
			Объект.ТипВыполнения = Перечисления.PAPI_ТипВыполнения.Произвольный;
		КонецЕсли;
		
	КонецЕсли; 
	
	ВидимостьИДоступностьЭлементов();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбора(ВыбранноеЗначение, ИсточникВыбора)
	
	Если ИсточникВыбора <> Неопределено Тогда 
		Если ТипЗнч(ИсточникВыбора) = Тип("ФормаКлиентскогоПриложения") Тогда
		
			Если ИсточникВыбора.ИмяФормы = "Справочник.PAPI_ПодпискиНаСобытия.Форма.ВыборИсточников" Тогда 
			
				Если Объект.Источники.Количество() > 0 Тогда 
					Объект.Источники.Очистить();
				КонецЕсли;
				
				Если ТипЗнч(ВыбранноеЗначение) = Тип("Массив") Тогда 
					
					Для Каждого элМассива Из ВыбранноеЗначение Цикл 
						ЗаполнитьЗначенияСвойств(Объект.Источники.Добавить(), элМассива); 
					КонецЦикла;
					
					Если Не Модифицированность Тогда 
						Модифицированность = Истина
					КонецЕсли;
					
				КонецЕсли;
				
			ИначеЕсли ИсточникВыбора.ИмяФормы = "Обработка.PAPI_КонсольКода.Форма.Форма" Тогда				
				КодПодписки = ВыбранноеЗначение;
				Модифицированность = Истина;
			КонецЕсли;			
			
        КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	Если Не ТекущийОбъект.ЭтоГруппа Тогда

		СтруктураНастройки = PAPI_ПодпискиНаСобытия.СтруктураНастроекПодписки(ТекущийОбъект.Настройки);

		Если СтруктураНастройки.Свойство("СП_КодПодписки") Тогда
			КодПодписки = СтруктураНастройки.СП_КодПодписки;	
		КонецЕсли;	
		
	КонецЕсли;	
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	Если Не Объект.ЭтоГруппа Тогда
		ПоместитьСтруктураАлгоритмаВНастройки(ТекущийОбъект);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти 

#Область ОбработчикиСобытийЭлементовГруппыСтраницы

&НаКлиенте
Процедура СобытиеПриИзменении(Элемент)
	
	Если Объект.Источники.Количество() > 0  Тогда 
		перТипПодписки = PAPI_ПодпискиНаСобытия.ПолучитьТипПодпискиСтрокой(Объект.Событие);
		
		// Доступные Источники
		ОбъектовМетаданныхПоПодписке = PAPI_ПодпискиНаСобытия.ПолучитьИсточникиПоТипу(перТипПодписки);		
		
		Для Каждого текСтрока Из Объект.Источники Цикл  
			
			Если СтрНайти(текСтрока.Источник, ".") > 0 Тогда 
				
				МассивРазделенныхЭлементов = СтрРазделить(текСтрока.Источник, ".", Истина);	
				Если МассивРазделенныхЭлементов.Количество() >= 1 Тогда 
		
					// Головной элемент
					ИскомоеЗначение = МассивРазделенныхЭлементов[0];
					
				Иначе 
					
					ИскомоеЗначение = "";
					
				КонецЕсли; 
				
			Иначе
				ИскомоеЗначение = текСтрока.Источник;	
			КонецЕсли;	
			
			Если Не ПустаяСтрока(ИскомоеЗначение)
				И ОбъектовМетаданныхПоПодписке.Найти(ИскомоеЗначение) <> Неопределено Тогда  
				
				текСтрока.Подписка = 1;   
				
			Иначе
				
				текСтрока.Подписка = 0;
				
			КонецЕсли;	
		КонецЦикла;
		
	КонецЕсли;	

КонецПроцедуры

&НаКлиенте
Процедура ТипВыполненияПриИзменении(Элемент) 
	
	ВидимостьИДоступностьЭлементов();
	
КонецПроцедуры

&НаКлиенте
Процедура ВыбратьИсточники(Команда)
	
	ТипПодписки = Объект.Событие;
	
	МассивВыбранных = Новый Массив;
	Для Каждого стрИсточники Из Объект.Источники Цикл 
		МассивВыбранных.Добавить(стрИсточники.Источник);	
	КонецЦикла;
	
	ПараметрыФормы = Новый Структура("МассивВыбранных, ТипПодписки", МассивВыбранных, ТипПодписки);
	ОткрытьФорму("Справочник.PAPI_ПодпискиНаСобытия.Форма.ВыборИсточников",ПараметрыФормы, ЭтаФорма, ЭтаФорма.УникальныйИдентификатор);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовГруппыСтраницы

&НаКлиенте
Процедура КодПодпискиОткрытие(Элемент, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ПарамОткрытия = Новый Структура;
	ПарамОткрытия.Вставить("Заголовок", "Алгоритм обработчика события");
	ПарамОткрытия.Вставить("ТекстАлгоритма", Элемент.ТекстРедактирования);	
	ПарамОткрытия.Вставить("РежимВыбора", Истина);	
	
	ПарамОткрытия.Вставить("ПользовательскиеОбъекты", ПользовательскиеОбъектыДляКонсолиКода());
	
	ОткрытьФорму("Обработка.PAPI_КонсольКода.Форма.Форма", 
			ПарамОткрытия, 
			ЭтотОбъект, 
			, 
			, 
			, 
			, 
			РежимОткрытияОкнаФормы.БлокироватьОкноВладельца
	);
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область КонсольКода

&НаКлиенте
Функция ПользовательскиеОбъектыДляКонсолиКода()
	
	ПользовательскиОбъекты = Новый Структура;
	
	ПараметрыСтрокой = "";
	Если Объект.Событие = ПредопределенноеЗначение("Перечисление.PAPI_ТипПодпискиНаСобытие.ПриКопировании") Тогда
		ПараметрыСтрокой = "Источник, ОбъектКопирования";
	ИначеЕсли Объект.Событие = ПредопределенноеЗначение("Перечисление.PAPI_ТипПодпискиНаСобытие.ОбработкаПроверкиЗаполнения") Тогда
		ПараметрыСтрокой = "Источник, Отказ, ПроверяемыеРеквизиты";
	ИначеЕсли Объект.Событие = ПредопределенноеЗначение("Перечисление.PAPI_ТипПодпискиНаСобытие.ПередЗаписью") Тогда
		ПараметрыСтрокой = "Источник, Отказ, РежимЗаписи, РежимПроведения";
	ИначеЕсли Объект.Событие = ПредопределенноеЗначение("Перечисление.PAPI_ТипПодпискиНаСобытие.ПриЗаписи") Тогда
		ПараметрыСтрокой = "Источник, Отказ";
	ИначеЕсли Объект.Событие = ПредопределенноеЗначение("Перечисление.PAPI_ТипПодпискиНаСобытие.ПередУдалением") Тогда
		ПараметрыСтрокой = "Источник, Отказ";
	ИначеЕсли Объект.Событие = ПредопределенноеЗначение("Перечисление.PAPI_ТипПодпискиНаСобытие.ОбработкаПроведения") Тогда
		ПараметрыСтрокой = "Источник, Отказ, РежимПроведения";
	ИначеЕсли Объект.Событие = ПредопределенноеЗначение("Перечисление.PAPI_ТипПодпискиНаСобытие.ОбработкаУдаленияПроведения") Тогда
		ПараметрыСтрокой = "Источник, Отказ";
	ИначеЕсли Объект.Событие = ПредопределенноеЗначение("Перечисление.PAPI_ТипПодпискиНаСобытие.ОбработкаФормированияПоВерсииИсторииДанных") Тогда
		ПараметрыСтрокой = "Источник, ДанныеВерсии, НомерВерсии, ИсключитьДанные, СтандартнаяОбработка";
	ИначеЕсли Объект.Событие = ПредопределенноеЗначение("Перечисление.PAPI_ТипПодпискиНаСобытие.ОбработкаПослеЗаписиВерсийИсторииДанных") Тогда
		ПараметрыСтрокой = "Источник, ИнформацияОЗаписиВерсий, ПараметрыПодписки";
	КонецЕсли;
	
	Для Каждого ИмяПараметра Из СтрРазделить(ПараметрыСтрокой, ",", Ложь) Цикл
		ПользовательскиОбъекты.Вставить(ИмяПараметра, Новый Структура("name", ИмяПараметра));
	КонецЦикла;
	
	Возврат ПользовательскиОбъекты;
	
КонецФункции

#КонецОбласти

&НаСервере
Процедура ПоместитьСтруктураАлгоритмаВНастройки(ТекущийОбъект)
		
// СтруктураПодписки ++		                    
	СтруктураДанных = Новый Структура;
	СтруктураПодписки = Новый Структура;
	СтруктураПодписки.Вставить("КодПодписки", КодПодписки);
		
	СтруктураДанных.Вставить("СтруктураПодписки", СтруктураПодписки);
// СтруктураПодписки --

	ДанныеXML = PAPI_ОбщегоНазначенияВызовСервера.СериализаторXML(СтруктураДанных);
	ТекущийОбъект.Настройки = Новый ХранилищеЗначения(?(ДанныеXML.Отработал, ДанныеXML.Результат,""));
	
КонецПроцедуры 

&НаСервере
Процедура ВидимостьИДоступностьЭлементов()

	Элементы.Алгоритм.Видимость 					=  Объект.ТипВыполнения = Перечисления.PAPI_ТипВыполнения.Алгоритм;
	Элементы.КодПодписки.Видимость 					=  Объект.ТипВыполнения = Перечисления.PAPI_ТипВыполнения.Произвольный;
	Элементы.ГруппаВнешняяОбработка.Видимость 		=  Объект.ТипВыполнения = Перечисления.PAPI_ТипВыполнения.ВнешняяОбработка;
	
КонецПроцедуры	

#КонецОбласти
